src/Catalogs/рнсПравилоИнициализацииДанных/рнсПравилоИнициализацииДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсПравилоИнициализацииДанных</name>
  <basedOn>Catalog.рнсШаблонНабораДанных</basedOn>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.рнсШаблонНабораДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеРеквизитов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТаблиц</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/рнсШаблонНабораДанных/рнсШаблонНабораДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсШаблонНабораДанных</name>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныеЗначения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабличныеЧасти</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КолонкиТабличныхЧастей</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсПравилоИнициализацииДанных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "КомпонентыПМФ") Тогда
		рнсОбщегоНазначения.ИнициализироватьПМФ(ЭтотОбъект);  	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();			
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Реквизиты 					= Новый Структура;
	ТабличныеЧасти 				= Новый Структура;                                           
	РеквизитыПравила 			= рнсОбщегоНазначения.КомпонентыРаздела(ЭтотОбъект, "КПИ.Реквизиты", 0); 
	ТаблицыПравила 				= рнсОбщегоНазначения.КомпонентыРаздела(ЭтотОбъект, "КПИ.ТабличныеЧасти", 0);;   
	
	Для каждого Ит Из РеквизитыПравила Цикл	
		
		ИмяРеквизитаФормы = Ит.ИмяКомпонента;	
		Значение = рнсОбщегоНазначения.ЗначениеРеквизитаФормы(ЭтотОбъект, ИмяРеквизитаФормы);
		
		Реквизиты.Вставить(ИмяРеквизитаФормы, Значение); 	
		
	КонецЦикла; 	               
	
	Для каждого Ит Из ТаблицыПравила Цикл
		
		ИмяРеквизитаФормы = Ит.ИмяКомпонента;
		Значение = рнсОбщегоНазначения.ЗначениеРеквизитаФормы(ЭтотОбъект, ИмяРеквизитаФормы); 
		
		ТабличныеЧасти.Вставить(ИмяРеквизитаФормы, Значение.Выгрузить());	
		
	КонецЦикла;
	
	ТекущийОбъект.ХранилищеРеквизитов 	= Новый ХранилищеЗначения(Реквизиты, Новый СжатиеДанных(9)); 
	ТекущийОбъект.ХранилищеТаблиц 		= Новый ХранилищеЗначения(ТабличныеЧасти, Новый СжатиеДанных(9)); 	 
	
КонецПроцедуры    

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	ИнициализироватьФормуПравила();		
	
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		Для каждого Ит Из Элемент.ПодчиненныеЭлементы Цикл
			
			ТекущаяСтрока 	= Элемент.ТекущиеДанные; 
			Компоненты 		= ЭтотОбъект.КомпонентыПМФ.НайтиСтроки(Новый Структура("ИмяКомпонента, ВидКомпонента", Ит.Имя, 0));
			
			// не работает установка значений по умолчанию
			
			Если ЗначениеЗаполнено(Компоненты) Тогда
				ТекущийКомпонент 								= Компоненты[0];
				ТекущаяСтрока[ТекущийКомпонент.ИмяКомпонента] 	= ТекущийКомпонент.ДополнительныеПараметры;	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФормуПравила(ТолькоЗаполнить = Ложь)
	
	Если НЕ ТолькоЗаполнить Тогда 	
	
		Если ЗначениеЗаполнено(Объект.Шаблон) Тогда	
			рнсОбщегоНазначения.УдалитьКомпонентыРазделаПМФ(ЭтотОбъект, "КПИ");	
		КонецЕсли;    
		
		ПодготовитьФормуПоШаблону(); 
	
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьРеквизитыПравила();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуПоШаблону()
	             	
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		
		СтраницаРеквизитов 	= Элементы.СтраницаРеквизиты; 
		МассивДобавляемыхРеквизитов	= Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рнсШаблонНабораДанных.ДоступныеЗначения КАК ДоступныеЗначения
		|ИЗ
		|	Справочник.рнсШаблонНабораДанных КАК рнсШаблонНабораДанных
		|ГДЕ
		|	рнсШаблонНабораДанных.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРеквизитов.ИмяПараметра КАК ИмяПараметра,
		|	ТаблицаРеквизитов.ТипПараметра КАК ТипПараметра,
		|	ТаблицаРеквизитов.Описание КАК Описание
		|ИЗ
		|	Справочник.рнсШаблонНабораДанных.Реквизиты КАК ТаблицаРеквизитов
		|ГДЕ
		|	ТаблицаРеквизитов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КолонкиТаблицы.ИмяПараметра КАК ИмяПараметра,
		|	КолонкиТаблицы.ТипПараметра КАК ТипПараметра,
		|	ТабличныеЧасти.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
		|	КолонкиТаблицы.КлючСвязи КАК КлючСвязи,
		|	КолонкиТаблицы.Описание КАК Описание
		|ИЗ
		|	Справочник.рнсШаблонНабораДанных.ТабличныеЧасти КАК ТабличныеЧасти
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.рнсШаблонНабораДанных.КолонкиТабличныхЧастей КАК КолонкиТаблицы
		|		ПО ТабличныеЧасти.Ссылка = КолонкиТаблицы.Ссылка
		|			И ТабличныеЧасти.КлючСвязи = КолонкиТаблицы.КлючСвязи
		|ГДЕ
		|	КолонкиТаблицы.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	ИмяТабличнойЧасти";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Шаблон);
		
		РезультатЗапроса 			= Запрос.ВыполнитьПакет(); 
		ВыборкаШапка				= РезультатЗапроса[0].Выбрать();
		ВыборкаРеквизиты 			= РезультатЗапроса[1].Выбрать();	
		ВыборкаИмяТабличнойЧасти 	= РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВыборкаШапка.Следующий();
		ТаблицаДопустимыхРеквизитов = ВыборкаШапка.ДоступныеЗначения.Получить();	
		
		// добавление реквизитов
		
		Пока ВыборкаРеквизиты.Следующий() Цикл
			
			ИмяРеквизита 	= ВыборкаРеквизиты.ИмяПараметра;
			ТипРеквизита 	= ?(ЗначениеЗаполнено(ВыборкаРеквизиты.ТипПараметра), ЗначениеИзСтрокиВнутр(ВыборкаРеквизиты.ТипПараметра), Новый ОписаниеТипов);	 		
			НовыйРеквизит	= Новый РеквизитФормы(ИмяРеквизита, ТипРеквизита);
			
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);	
			
			рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, "КПИ.Реквизиты", НовыйРеквизит, 0);
			
		КонецЦикла;			
		
		Пока ВыборкаИмяТабличнойЧасти.Следующий() Цикл
			
			ИмяТабличнойЧасти 	= ВыборкаИмяТабличнойЧасти.ИмяТабличнойЧасти;   
			РеквизитТаблицы		= Новый РеквизитФормы(ИмяТабличнойЧасти, Новый ОписаниеТипов("ТаблицаЗначений"));
			
			МассивДобавляемыхРеквизитов.Добавить(РеквизитТаблицы);
			
			рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, "КПИ.ТабличныеЧасти", РеквизитТаблицы, 0);
			
			ВыборкаКолонки = ВыборкаИмяТабличнойЧасти.Выбрать();
			
			Пока ВыборкаКолонки.Следующий() Цикл   
				
				ИмяРеквизита 	= ВыборкаКолонки.ИмяПараметра;
				ТипРеквизита 	= ?(ЗначениеЗаполнено(ВыборкаКолонки.ТипПараметра), ЗначениеИзСтрокиВнутр(ВыборкаКолонки.ТипПараметра), Новый ОписаниеТипов);
				
				МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита, ТипРеквизита, ИмяТабличнойЧасти));				
				
			КонецЦикла;  
			
		КонецЦикла;	    
		
		ВыборкаРеквизиты.Сбросить();
		ВыборкаИмяТабличнойЧасти.Сбросить();
		
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, );
		
		// создание элементов и заполнение их по умолчанию
		
		Пока ВыборкаРеквизиты.Следующий() Цикл 
			
			ЗначениеПоУмолчанию			= Неопределено;
			ИмяРеквизита 				= ВыборкаРеквизиты.ИмяПараметра; 			
			СвойстваЭлемента 			= СвойстваЭлементаФормы(ТаблицаДопустимыхРеквизитов, ЗначениеПоУмолчанию, ИмяРеквизита, ВыборкаРеквизиты.Описание);
			ЭтотОбъект[ИмяРеквизита] 	= ЗначениеПоУмолчанию;
			
			ПолеВвода = рнсОбщегоНазначения.СоздатьЭлементФормы(ЭтотОбъект, СвойстваЭлемента, Тип("ПолеФормы"), СтраницаРеквизитов); 		
			
			рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, "КПИ.Реквизиты", ПолеВвода.Имя, 1);
			
		КонецЦикла; 
		
		Пока ВыборкаИмяТабличнойЧасти.Следующий() Цикл  			
				
			ИмяТабличнойЧасти 	= ВыборкаИмяТабличнойЧасти.ИмяТабличнойЧасти; 
			СвойстваТаблицы		= Новый Структура("Имя, Действия", ИмяТабличнойЧасти, Новый Структура("ПриНачалеРедактирования", "ТаблицаПриНачалеРедактирования"));
			ПараметрыСтраницы  	= Новый Структура("Имя, Вид, Заголовок", ИмяТабличнойЧасти, ВидГруппыФормы.Страница, рнсОбщегоНазначения.ЗРег(ИмяТабличнойЧасти));
			СтраницаТаблицы 	= рнсОбщегоНазначения.СоздатьЭлементФормы(ЭтотОбъект, ПараметрыСтраницы, Тип("ГруппаФормы"), Элементы.Страницы);
			ТаблицаФормы		= рнсОбщегоНазначения.СоздатьЭлементФормы(ЭтотОбъект, СвойстваТаблицы, Тип("ТаблицаФормы"), СтраницаТаблицы);
			
			рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, "КПИ.ТабличныеЧасти", ТаблицаФормы, 1);  
			рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, "КПИ", СтраницаТаблицы, 1);
			
			ВыборкаКолонки = ВыборкаИмяТабличнойЧасти.Выбрать();
			
			Пока ВыборкаКолонки.Следующий() Цикл   
				
				КлючСвязи			= ВыборкаКолонки.КлючСвязи;
				ИмяРеквизита 		= ВыборкаКолонки.ИмяПараметра;
				СвойстваЭлемента 	= СвойстваЭлементаФормы(ТаблицаДопустимыхРеквизитов, ЗначениеПоУмолчанию, ИмяРеквизита, ВыборкаРеквизиты.Описание, КлючСвязи);
				КолонкаТаблицы 		= рнсОбщегоНазначения.СоздатьЭлементФормы(ЭтотОбъект, СвойстваЭлемента, Тип("ПолеФормы"), ТаблицаФормы); 
			
				рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, "КПИ.Колонки", КолонкаТаблицы, 1, ЗначениеПоУмолчанию);	
				
			КонецЦикла;  
			
		КонецЦикла;  	
		
	КонецЕсли; 	
	
КонецПроцедуры     

&НаСервере
Процедура ЗаполнитьРеквизитыПравила()
	
	ДанныеТаблицы			= Неопределено;
	ПравилоОбъект 			= РеквизитФормыВЗначение("Объект");  
	ТаблицыОбъекта			= ПравилоОбъект.ХранилищеТаблиц.Получить();
	КоллекцияРеквизитов	  	= ПравилоОбъект.ХранилищеРеквизитов.Получить(); 
	ТаблицыПравила 			= рнсОбщегоНазначения.КомпонентыРаздела(ЭтотОбъект, "КПИ.ТабличныеЧасти", 0);		
	
	Если ЗначениеЗаполнено(ТаблицыОбъекта) Тогда	
	
		Для каждого Ит Из ТаблицыПравила Цикл 
			Если ТаблицыОбъекта.Свойство(Ит.ИмяКомпонента, ДанныеТаблицы) Тогда				
				ЭтотОбъект[Ит.ИмяКомпонента].Загрузить(ДанныеТаблицы);			
			КонецЕсли;
		КонецЦикла; 
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоллекцияРеквизитов) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, КоллекцияРеквизитов);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ТолькоЗаполнитьДанными = Истина;	
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "КомпонентыПМФ") Тогда
		рнсОбщегоНазначения.ИнициализироватьПМФ(ЭтотОбъект);
		ТолькоЗаполнитьДанными = Ложь;
	КонецЕсли; 
	
	ИнициализироватьФормуПравила(ТолькоЗаполнитьДанными);
	
КонецПроцедуры 

&НаСервере
Функция СвойстваЭлементаФормы(ТаблицаДопустимыхРеквизитов, ЗначениеПоУмолчанию, ИмяПараметра, Описание, КлючСвязи = "")
	
	ЗначениеПоУмолчанию = Неопределено;
	Результат 			= Новый Структура("Имя, Вид", ИмяПараметра, ВидПоляФормы.ПолеВвода); 
	СтрокиТаблицы 		= ТаблицаДопустимыхРеквизитов.НайтиСтроки(Новый Структура("ИмяПараметра, КлючСвязи", ИмяПараметра, КлючСвязи));			
	
	Если ЗначениеЗаполнено(СтрокиТаблицы) Тогда    
		
		Если СтрокиТаблицы.Количество() = 1 И СтрокиТаблицы[0].ЭтоЗначениеПоУмолчанию Тогда
			ЗначениеПоУмолчанию = СтрокиТаблицы[0].Значение;	
		Иначе         
			
			СписокВыбора = Новый Массив;
			
			Для каждого Ит Из СтрокиТаблицы Цикл
				
				СписокВыбора.Добавить(Ит.Значение);	
				        	
				Если Ит.ЭтоЗначениеПоУмолчанию Тогда
					ЗначениеПоУмолчанию = Ит.Значение;	
				КонецЕсли;
				
			КонецЦикла; 
			
			Результат.Вставить("РежимВыбораИзСписка", Истина); 
			Результат.Вставить("СписокВыбора", СписокВыбора); 
			
		КонецЕсли; 		
		
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Описание) Тогда
		Результат.Вставить("Подсказка", Описание);
		Результат.Вставить("ОтображениеПодсказки", ?(ЗначениеЗаполнено(КлючСвязи), ОтображениеПодсказки.Авто, ОтображениеПодсказки.Кнопка));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции   

#КонецОбласти
